RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1050/MIMXRT1052/drivers/fsl_semc.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name SEMC Initialization and De-initialization
 * @{
 */

/*!
 * @brief Gets the SEMC default basic configuration structure.
 *
 * The purpose of this API is to get the default SEMC
 * configure structure for SEMC_Init(). User may use the initialized
 * structure unchanged in SEMC_Init(), or modify some fields of the
 * structure before calling SEMC_Init().
 * Example:
   @code
   semc_config_t config;
   SEMC_GetDefaultConfig(&config);
   @endcode
 * @param config The SEMC configuration structure pointer.
 */
void SEMC_GetDefaultConfig(semc_config_t *config);

/*!
 * @brief Initializes SEMC.
 * This function ungates the SEMC clock and initializes SEMC.
 * This function must be called before calling any other SEMC driver functions.
 *
 * @param base SEMC peripheral base address.
 * @param configure The SEMC configuration structure pointer.
 */
void SEMC_Init(SEMC_Type *base, semc_config_t *configure);

/*!
 * @brief Deinitializes the SEMC module and gates the clock.
 *
 * This function gates the SEMC clock. As a result, the SEMC module doesn't work after
 * calling this function, for some IDE, calling this API may cause the next downloading
 * operation failed. so, please call this API cautiously. Additional, users can
 * using "#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL (1)" to disable the clock control
 * operation in drivers.
 *
 * @param base SEMC peripheral base address.
 */
void SEMC_Deinit(SEMC_Type *base);

/* @} */

/*!
 * @name SEMC Configuration Operation For Each Memory Type
 * @{
 */

/*!
 * @brief Configures SDRAM controller in SEMC.
 *
 * @param base SEMC peripheral base address.
 * @param cs The chip selection.
 * @param config The sdram configuration.
 * @param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureSDRAM(SEMC_Type *base, semc_sdram_cs_t cs, semc_sdram_config_t *config, uint32_t clkSrc_Hz);

/*!
 * @brief Configures NAND controller in SEMC.
 *
 * @param base SEMC peripheral base address.
 * @param config The nand configuration.
 * @param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureNAND(SEMC_Type *base, semc_nand_config_t *config, uint32_t clkSrc_Hz);

/*!
 * @brief Configures NOR controller in SEMC.
 *
 * @param base SEMC peripheral base address.
 * @param config The nor configuration.
 * @param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureNOR(SEMC_Type *base, semc_nor_config_t *config, uint32_t clkSrc_Hz);

/*!
 * @brief Configures SRAM controller in SEMC.
 *
 * @param base SEMC peripheral base address.
 * @param config The sram configuration.
 * @param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureSRAM(SEMC_Type *base, semc_sram_config_t *config, uint32_t clkSrc_Hz);

/*!
 * @brief Configures DBI controller in SEMC.
 *
 * @param base SEMC peripheral base address.
 * @param config The dbi configuration.
 * @param clkSrc_Hz The SEMC clock frequency.
 */
status_t SEMC_ConfigureDBI(SEMC_Type *base, semc_dbi_config_t *config, uint32_t clkSrc_Hz);

/* @} */

/*!
 * @name SEMC Interrupt Operation
 * @{
 */

/*!
 * @brief Enables the SEMC interrupt.
 *
 * This function enables the SEMC interrupts according to the provided mask. The mask
 * is a logical OR of enumeration members. See @ref semc_interrupt_enable_t.
 * For example, to enable the IP command done and error interrupt, do the following.
 * @code
 *     SEMC_EnableInterrupts(ENET, kSEMC_IPCmdDoneInterrupt | kSEMC_IPCmdErrInterrupt);
 * @endcode
 *
 * @param base  SEMC peripheral base address.
 * @param mask  SEMC interrupts to enable. This is a logical OR of the
 *             enumeration :: semc_interrupt_enable_t.
 */
static inline void SEMC_EnableInterrupts(SEMC_Type *base, uint32_t mask)
{
    base->INTEN |= mask;
}

/*!
 * @brief Disables the SEMC interrupt.
 *
 * This function disables the SEMC interrupts according to the provided mask. The mask
 * is a logical OR of enumeration members. See @ref semc_interrupt_enable_t.
 * For example, to disable the IP command done and error interrupt, do the following.
 * @code
 *     SEMC_DisableInterrupts(ENET, kSEMC_IPCmdDoneInterrupt | kSEMC_IPCmdErrInterrupt);
 * @endcode
 *
 * @param base  SEMC peripheral base address.
 * @param mask  SEMC interrupts to disable. This is a logical OR of the
 *             enumeration :: semc_interrupt_enable_t.
 */
static inline void SEMC_DisableInterrupts(SEMC_Type *base, uint32_t mask)
{
    base->INTEN &= ~mask;
}

/*!
 * @brief Gets the SEMC status.
 *
 * This function gets the SEMC interrupts event status.
 * User can use the a logical OR of enumeration member as a mask.
 * See @ref semc_interrupt_enable_t.
 *
 * @param base  SEMC peripheral base address.
 * @return status flag, use status flag in semc_interrupt_enable_t to get the related status.
 */
static inline bool SEMC_GetStatusFlag(SEMC_Type *base)
{
    return base->INTR;
}

/*!
 * @brief Clears the SEMC status flag state.
 *
 * The following status register flags can be cleared SEMC interrupt status.
 *
 * @param base SEMC base pointer
 * @param mask The status flag mask, a logical OR of enumeration member @ref semc_interrupt_enable_t.
 */
static inline void SEMC_ClearStatusFlags(SEMC_Type *base, uint32_t mask)
{
    base->INTR |= mask;
}

/* @} */

/*!
 * @name SEMC Memory Access Operation
 * @{
 */

/*!
 * @brief Check if SEMC is in idle.
 *
 * @param base  SEMC peripheral base address.
 * @return  True SEMC is in idle, false is not in idle.
 */
static inline bool SEMC_IsInIdle(SEMC_Type *base)
{
    return (base->STS0 & SEMC_STS0_IDLE_MASK) ? true : false;
}

/*!
 * @brief SEMC IP command access.
 *
 * @param base  SEMC peripheral base address.
 * @param type  SEMC memory type. refer to "semc_mem_type_t"
 * @param address  SEMC device address.
 * @param command  SEMC IP command.
 * For NAND device, we should use the SEMC_BuildNandIPCommand to get the right nand command.
 * For NOR/DBI device, take refer to "semc_ipcmd_nor_dbi_t".
 * For SRAM device, take refer to "semc_ipcmd_sram_t".
 * For SDRAM device, take refer to "semc_ipcmd_sdram_t".
 * @param write  Data for write access.
 * @param read   Data pointer for read data out.
 */
status_t SEMC_SendIPCommand(
    SEMC_Type *base, semc_mem_type_t type, uint32_t address, uint16_t command, uint32_t write, uint32_t *read);

/*!
 * @brief Build SEMC IP command for NAND.
 *
 * This function build SEMC NAND IP command. The command is build of user command code,
 * SEMC address mode and SEMC command mode.
 *
 * @param userCommand  NAND device normal command.
 * @param addrMode  NAND address mode. Refer to "semc_ipcmd_nand_addrmode_t".
 * @param cmdMode   NAND command mode. Refer to "semc_ipcmd_nand_cmdmode_t".
 */
static inline uint16_t SEMC_BuildNandIPCommand(uint8_t userCommand,
                                               semc_ipcmd_nand_addrmode_t addrMode,
                                               semc_ipcmd_nand_cmdmode_t cmdMode)
{
    return (uint16_t)((uint16_t)userCommand << 8) | (uint16_t)(addrMode << 4) | ((uint8_t)cmdMode & 0x0Fu);
}

/*!
 * @brief Check if the NAND device is ready.
 *
 * @param base  SEMC peripheral base address.
 * @return  True NAND is ready, false NAND is not ready.
 */
static inline bool SEMC_IsNandReady(SEMC_Type *base)
{
    return (base->STS0 & SEMC_STS0_NARDY_MASK) ? true : false;
}

/*!
 * @brief SEMC NAND device memory write through IP command.
 *
 * @param base  SEMC peripheral base address.
 * @param address  SEMC NAND device address.
 * @param data  Data for write access.
 * @param size_bytes   Data length.
 */
status_t SEMC_IPCommandNandWrite(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/*!
 * @brief SEMC NAND device memory read through IP command.
 *
 * @param base  SEMC peripheral base address.
 * @param address  SEMC NAND device address.
 * @param data  Data pointer for data read out.
 * @param size_bytes   Data length.
 */
status_t SEMC_IPCommandNandRead(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/*!
 * @brief SEMC NOR device memory write through IP command.
 *
 * @param base  SEMC peripheral base address.
 * @param address  SEMC NOR device address.
 * @param data  Data for write access.
 * @param size_bytes   Data length.
 */
status_t SEMC_IPCommandNorWrite(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/*!
 * @brief SEMC NOR device memory read through IP command.
 *
 * @param base  SEMC peripheral base address.
 * @param address  SEMC NOR device address.
 * @param data  Data pointer for data read out.
 * @param size_bytes   Data length.
 */
status_t SEMC_IPCommandNorRead(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_SEMC_H_*/
